{
    "scrambled_eggs": {
        "ingredients": [
            "eggs",
            "milk",
            "butter",
            "salt",
            "white pepper"
        ],
        "directions": [
            "1. Crack the eggs into a glass mixing bowl and beat them until they turn a pale yellow color.",
            "2. Heat a heavy-bottomed nonstick sauté pan over medium-low heat.",
            "   Add the butter and let it melt.",
            "3. Add the milk to the eggs and season to taste with salt and white pepper.",
            "   Then, grab your whisk and whisk like crazy.",
            "4. When the butter in the pan is hot enough to make a drop of water hiss, pour in the eggs.",
            "   Don't stir! Let the eggs cook for up to a minute or until the bottom starts to set.",
            "5. With a heat-resistant rubber spatula, gently push one edge of the egg into the center of the pan, while tilting the pan to allow the still liquid egg to flow in underneath.",
            "   Repeat with the other edges, until there's no liquid left.",
            "6. Turn off the heat and continue gently stirring and turning the egg until all the uncooked parts become firm.",
            "   Don't break up the egg, though. Try to keep the curds as large as possible.",
            "   If you're adding any other ingredients, now's the time to do it. (See note.)",
            "7. Transfer to a plate when the eggs are set but still moist and soft.",
            "   Eggs are delicate, so they'll continue to cook for a few moments after they're on the plate."
        ]
    },
    "pancakes": {
        "ingredients": [
            "eggs",
            "butter",
            "salt",
            "milk",
            "flour",
            "baking powder",
            "sugar"
        ], 
        "directions": [
            "1. In a large bowl, sift together the flour, baking powder, salt and sugar.",
            "   Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.",
            "2. Heat a lightly oiled griddle or frying pan over medium high heat.",
            "   Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake.",
            "   Brown on both sides and serve hot."
        ]
    }
}
